# StairsRunBeginWithRiser Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunBeginWithRiser Property
ParameterTypeId Class See Also
---
"Begin with Riser": Begin with Riser
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunBeginWithRiser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunBeginWithRiser As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunBeginWithRiser {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace